import random

dict_republics_capitals = {
    "Адыгея": "Майкоп",
    "Алтай": "Горно-Алтайск",
    "Башкортостан": "Уфа",
    "Бурятия": "Улан-Удэ",
    "Дагестан": "Махачкала",
    "ДНР": "Донецк",
    "Ингушетия": "Магас",
    "Кабардино-Балкарская": "Нальчик",
    "Калмыкия": "Элиста",
    "Карачаево-Черкесская": "Черкесск",
    "Карелия": "Петрозаводск",
    "Коми": "Сыктывкар",
    "Крым": "Симферополь",
    "ЛНР": "Луганск",
    "Марий-Эл": "Йошкар-Ола",
    "Мордовия": "Саранск",
    "Саха (Якутия)": "Якутск",
    "Северная Осетия": "Владикавказ",
    "Татарстан": "Казань",
    "Тыва": "Кызыл",
    "Удмуртская": "Ижевск",
    "Хакасия": "Абакан",
    "Чеченская (Чечня)": "Грозный",
    "Чувашская": "Чебоксары"
}

list1 = [el for el in dict_republics_capitals.keys()]

republic = random.choice(list1)
print(f"Республика: {republic}")
print(f"Столица: {dict_republics_capitals[republic]}")
